
//HOMEWORK1
/*Задача 2: Напишите программу, которая на вход принимает два числа и выдаёт, какое число большее, а какое меньшее.
a = 5; b = 7 -> max = 7
a = 2 b = 10 -> max = 10
a = -9 b = -3 -> max = -3*/

/*Задача 4: Напишите программу, которая принимает на вход три числа и выдаёт максимальное из этих чисел.
2, 3, 7 -> 7
44 5 78 -> 78
22 3 9 -> 22
*/

/*Задача 6: Напишите программу, которая на вход принимает число и выдаёт, является ли число чётным (делится ли оно на два без остатка).
4 -> да
-3 -> нет
7 -> нет*/

/*Задача 8: Напишите программу, которая на вход принимает число (N > 0), а на выходе показывает все чётные числа от 1 до N.
5 -> 2, 4
8 -> 2, 4, 6, 8
*/


//HOMEWORK2
/*Задача 10. Написать программу, которая принимает на вход трехзначное число и на выходе показывает вторую чифру этого числа.
456->57*/

/*Задача 13.Написать программу, которая с помощью деления выводит третью цифру заданного числа или сообщает, что третьей цифры нет.
//654->4
//78->третьей цифры нет*/

/* Задача 15. Написать программу, которая принимает на вход цифру, обозначающую день недели, и проверяет, является ли это день выходным
//6-> да
//1-> нет*/

//HOMEWORK3

/*Задача 19. Напишите программу, которая принимает на вход пятизначное число и проверяет, явялется ли оно палиндромом
//14212-нет
//23432-да*/

/*Задача 21. Напишите программу, которая принимает на вход координаты двух точек и находит растояние между ними в 3D пространстве.*/

/*Задача 23. Напишите программу, которая принимает на вход число (N) и выдает таблицу кубов чисел от 1 до N
//3->1, 8, 27*/


//HOMEWORK4
/*Задача 25. Используя определение степени числа, напишите цикл, который принимает на вход 2 натуральных числа А и В и возводит число А в степень В
//3,5->243
//2,4->16*/

/*ЗАдача 27.Напишите программ, которая принимает на вход число и выдает сумму цифр в числе
// 452-11//82-10.*/

/*Задача 29. Напишите программу, которая задает массив из 8 случайных чисел и выводи отсоритированный массив по модолю числа
//6,1,-33->[1,6,-33]*/
