Console.Clear();

void Метод()
{
/*Методы делятся на 2 вида:
1. Процедуры-ничего нам не возращает(кинул камен в воду-процесс выполнился и нам ничего не вернулось)
2. Функции (return)-возращает значение после обработки(мясорубка заложили мясо, получили фарш)

Процедура(что бы не комментировать задачи иожно использовать процедуру.)*/

void Zadacha() //-void это тип данных, т.е это процедура которая ничего не выводит(можно свернуть/развернуть)
{
    //Вся задача между фигурными скобками
}
}

//Задача 9. Напишите программу, которая выводи случайное число из отрезка [10,99] и показывает наибольшую цифру числа
//78->8

