Console.Clear();
//Задача 9. Напишите программу, которая выводи случайное число из отрезка [10,99] и показывает наибольшую цифру числа
//продалжить с 1:04:38
/*Методы делятся на 2 вида:
1. Процедуры-ничего нам не возращает(кинул камен в воду-процесс выполнился и нам ничего не вернулось)
2. Функции (return)-возращает значение после обработки(мясорубка заложили мясо, получили фарш)

Процедура(что бы не комментировать задачи иожно использовать процедуру.)
void Zadacha2() -void это тип данных, т.е это процедура которая ничего не выводит
{
    Вся задача между фигурными скобками
}
*/