Console.Clear();
DateTime lastTime = DateTime.Now;
Console.WriteLine(DateTime.Now - lastTime);
Console.WriteLine();

void Zadacha19()
//Задача 19. Напишите программу, которая принимает на вход пятизначное число и проверяет, явялется ли оно палиндромом
//14212-нет
//23432-да
{
    Console.WriteLine("Введите 5 цифр");
    int palindrom=Convert.ToInt32(Console.ReadLine());

}

void Zadacha21()
//Задача 21. Напишите программу, которая принимает на вход координаты двух точек и находит растояние между ними в 3D пространстве.
{

}

void Zadacha23()
//Задача 23. Напишите программу, которая принимает на вход число (N) и выдает таблицу кубов чисел от 1 до N
//3->1, 8, 27
{

}