Console.Clear();

void Task25()
//Задача 25. Используя определение степени числа, напишите цикл, который принимает на вход 2 натуральных числа А и В и возводит число А в степень В
//3,5->243
//2,4->16

{


}

void Task27()
//ЗАдача 27.Напишите программ, которая принимает на вход число и выдает сумму цифр в числе
// 452-11//82-10.
{

}

void Task29()
//Задача 29. Напишите программу, которая задает массив из 8 случайных чисел и выводи отсоритированный массив по модолю числа
//6,1,-33->[1,6,-33]
{

}